Revit 2026 API

# SelectionFilterAction Enumeration

---

An enumerated type containing the type of actions that may be taken with a selection filter applied to a point cloud.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum SelectionFilterAction
```
```vb
Public Enumeration SelectionFilterAction
```
```cpp
public enum class SelectionFilterAction
```
```fsharp
type SelectionFilterAction
```

| Member name | Value | Description |
| --- | --- | --- |
| Highlight | 1 | Points that pass the filter are highlighted. |
| Isolate | 2 | Only points that pass the filter are visible. |
| None | 0 | Selection filter is ignored. |

#### Reference

Autodesk.Revit.DB Namespace